"""Templater - formater - шаблонізатор"""
#Конструктор для рядків, який допомагає швидко та зручно зібрати рядок з різних частин
# num_1 = 54
# num_2 = 35
# action = '-'

#f - дискриптор активації шаблонізатора
# print(f'рішення прикладу {num_1} {action} {num_2} = {num_1 - num_2}')
# print('рішення прикладу {num_1} {action} {num_2} = {num_1 - num_2}')


# str_1 = f'''число_1 = {num_1}
# число_2 = {num_2}
# дія = {action}'''
#
# print(str_1)

# str_1 = input(f'Введіть число більше {num_1}')

"""Practice"""
"""#1"""
#Видалити з введеного в консолі рядка символи "i" та "U"
# str_1 = input('Input something: ')

# print(str_1.replace('i', ''))
#replace('i', '') - хитривуте видалення
# print(str_1)

# print(str_1.replace('i', ''))
# print(str_1.replace('U', ''))

# str_1 = str_1.replace('i', '')
# str_1 = str_1.replace('U', '')
# print(str_1)

"""Chain methods - ланцюжок методів"""
# str_1 = str_1.replace('i', '').replace('U', '')
# print(str_1)

# print(str_1.replace('i', '').replace('U', '').count('a'))

"""#2"""
# Cтворити алгоритм перевірки 4го за індексом елемента рядка
# Якщо цей 4й за індексом елемент є ВЕЛИКА літера то перетворіть всі літери рядка на великі
# Якщо цей 4й за індексом елемент є маленька літера то перетворіть всі літери рядка на маленькі

# str_1 = input('Input the string: ')

# print(str_1[4])
# print(str_1[4].isupper())
# print(str_1[4].islower())
# if len(str_1) > 4:
#     if str_1[4].isupper():
#         str_1 = str_1.upper()
#     elif str_1[4].islower():
#         str_1 = str_1.lower()
#
# print(str_1)

"""#3"""
# Створити алгоритм перевірки 3х останніх символів рядка
# Якщо три останні символи рядка є цифрами то видалити з рядка тільки три останніх символи
# Якщо три останні символи є маленькими літерами то перетворити три останні символи на великі літери

# str_1 = input('Input str: ')
# #
# # print(str_1[-1])
# # print(str_1[-2])
# # print(str_1[-3])
#
# # if str_1[-1].isdigit() and str_1[-2].isdigit() and str_1[-3].isdigit():
#
# # print(str_1[-3:])
# if str_1[-3:].isdigit():
#     # str_1 = str_1.replace(str_1[-3:], '') #видаляє все що знайде в рядку а не тільки 3и останні символи
#
#     #видалення зрізом
#     # str_1 = str_1[0:-3]
#     str_1 = str_1[:-3]
# elif str_1[-3:].islower():
#     str_1 = str_1[:-3] + str_1[-3:].upper()
#
# print(str_1)

"""#4"""
#Створити три рядки(заповнити даними з консолі)
#В першому рядку копію кожного 2го символа рядка перетворити на велику літеру(якщо це літера)
#В другому рядку копію кожного 2го символа починаючи з кінця рядка перетворити на маленькі літери(якщо це літери)
# В третьому рядку копію кожного 3го символа починаючи з середини рядка записати в інший рядок

# 4_1
# str_1 = input('Inp string: ')
# print(str_1[::2].upper())

#4_2
# str_2 = input('Input string: ')
# print(str_2[::-2].lower())

#4_3
# str_3 = input('String: ')

# len() - функція яка повертає кількість елементів рядка
# print(len(str_3))
# print(len(str_3) / 2 )
# print(len(str_3) // 2)
# midle_index = len(str_3) // 2
#
# print(str_3[midle_index : :3])
